# Aprofundado na biblioteca `pandas` do `Python`

In [40]:
# Importando a biblioteca pandas
import pandas as pd

In [41]:
df = pd.DataFrame(
    {
        "Name":[
            "Lucas Ribeiro",
            "Elenice Tizziani",
            "Fernando Tizziani",
            "Karem Nepomuceno",
            "Ana Clara Nepomuceno",
            "Paula vieira",
            "Ciro Nepomuceno",
            "Maria Eduarda Nepomuceno",
            "JOse Caçdeira",
            "Augusta Ribeiro",

    ],
        "idade":[45, 48, 25, 12, 18, 45, 32, 16, 73, 70],
        "cidade":[
            "Araçuai","Capanema",
            "Vilhena","Vilhena",
            "Belo Horizonte","Rio de Janeiro",
            "Araçuai","Curitiba",
            "Araçuai","Araçuai"
        ],
        "estado":[
            "MG","PR",
            "RO","RO",
            "MG","RJ",
            "MG","PR",
            "MG","MG",
        ],
        "sexo":[
            "M","F",
            "M","F",
            "F","F",
            "M","F",
            "M","F"
        ],
        "grau de instrução":[
            "Mestrado","Doutorado",
            "Superior Completo","Ensino Médio",
            "Superior Completo","Ensino Médio",
            "Ensino Fundamental Incompleto","Ensino Médio",
            "Ensino Fundamental Incompleto","Ensino Fundamental Incompleto"
        ],


}
)

In [42]:
df

,Name,idade,cidade,estado,sexo,grau de instrução
0,Lucas Ribeiro,45,Araçuai,MG,M,Mestrado
1,Elenice Tizziani,48,Capanema,PR,F,Doutorado
2,Fernando Tizziani,25,Vilhena,RO,M,Superior Completo
3,Karem Nepomuceno,12,Vilhena,RO,F,Ensino Médio
4,Ana Clara Nepomuceno,18,Belo Horizonte,MG,F,Superior Completo
5,Paula vieira,45,Rio de Janeiro,RJ,F,Ensino Médio
6,Ciro Nepomuceno,32,Araçuai,MG,M,Ensino Fundamental Incompleto
7,Maria Eduarda Nepomuceno,16,Curitiba,PR,F,Ensino Médio
8,JOse Caçdeira,73,Araçuai,MG,M,Ensino Fundamental Incompleto
9,Augusta Ribeiro,70,Araçuai,MG,F,Ensino Fundamental Incompleto

In [43]:
df["idade"]

0    45
1    48
2    25
3    12
4    18
5    45
6    32
7    16
8    73
9    70
Name: idade, dtype: int64

In [44]:
df[["idade", "cidade", "estado"]]

   idade          cidade estado
0     45         Araçuai     MG
1     48        Capanema     PR
2     25         Vilhena     RO
3     12         Vilhena     RO
4     18  Belo Horizonte     MG
5     45  Rio de Janeiro     RJ
6     32         Araçuai     MG
7     16        Curitiba     PR
8     73         Araçuai     MG
9     70         Araçuai     MG

In [45]:
# Series também pode criar um do zero:
idade = pd.Series([45, 48, 25, 12, 18, 45, 80, 16, 73, 70])
idade

0    45
1    48
2    25
3    12
4    18
5    45
6    80
7    16
8    73
9    70
dtype: int64

In [46]:
# saber a idade maxima
df["idade"].max()

np.int64(73)

In [47]:
# imformações estatisticas basicas do dataframe
df.describe()

           idade
count  10.000000
mean   38.400000
std    21.629198
min    12.000000
25%    19.750000
50%    38.500000
75%    47.250000
max    73.000000

# Lendo dados tabulares com a biblioteca `pandas`
O pandas fornece a read_csv()função de ler dados armazenados como um arquivo csv em um pandas DataFrame. 
O pandas suporta muitos formatos de arquivo ou fontes de dados diferentes prontos para uso (csv, excel, sql, json, parquet, …),
 cada um deles com o prefixo read_*.csv()é um dos mais comuns, então vamos ver como ele funciona.

In [48]:
titanic = pd.read_csv("datasets/titanic_completa_oficial.csv")
titanic.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48,0,0,19952,26.55,E12,S,3,?,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63,1,0,13502,77.9583,D7,S,10,?,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0,A36,S,?,?,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53,2,0,11769,51.4792,C101,S,D,?,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,49.5042,?,C,?,22,"Montevideo, Uruguay"

In [49]:
# intepretando dados tabulares com a biblioteca `pandas`
titanic.dtypes

pclass        int64
survived      int64
name         object
sex          object
age          object
sibsp         int64
parch         int64
ticket       object
fare         object
cabin        object
embarked     object
boat         object
body         object
home.dest    object
dtype: object

In [50]:
# Resumo dos tipos de dados
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

# Seleionado subconjuntos no DataFrame

In [51]:
# Lendo umas unica coluna
age = titanic["age"]
age.head(10)

0        29
1    0.9167
2         2
3        30
4        25
5        48
6        63
7        39
8        53
9        71
Name: age, dtype: object

In [52]:
#Verificndo o tipo de saida
type(titanic["age"])

pandas.core.series.Series

In [53]:
# verificnando o shape de saida
titanic["age"].shape

(1309,)

In [54]:
# verificando mais de uma coluna
titanic[["age", "sex"]].head(10)

      age     sex
0      29  female
1  0.9167    male
2       2  female
3      30    male
4      25  female
5      48    male
6      63  female
7      39    male
8      53  female
9      71    male

In [55]:
# Tipos de dados retornado nas colunas 
type(titanic[["age","sex"]])

pandas.core.frame.DataFrame

In [56]:
titanic[["age", "sex"]].shape

(1309, 2)

In [57]:
titanic["age"] = pd.to_numeric(titanic["age"], errors="coerce")

# Filtrar linha especifica no Datafram

In [58]:
# Filtrando os funcionarios acima de 32 anos 
acima_35 = titanic[titanic["age"] > 35]
acima_35.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.55,E12,S,3,?,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,?,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0,A36,S,?,?,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,?,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,?,C,?,22,"Montevideo, Uruguay"

In [59]:
titanic["age"]>35

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: age, Length: 1309, dtype: bool

In [60]:
acima_35.shape

(322, 14)

In [61]:
class3 = titanic[titanic["pclass"].isin([2,3])]
class3.tail(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,?,C,C,?,?
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,?,C,?,?,?
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.225,?,C,?,312,?
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.225,?,C,?,?,?
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,?,C,?,?,?
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,?,C,?,328,?
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,?,C,?,?,?
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,?,C,?,304,?
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.225,?,C,?,?,?
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.875,?,S,?,?,?

In [62]:
class3 = titanic[(titanic["pclass"]== 2) | (titanic["pclass"]==3)]
class3.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
323,2,0,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24,?,C,?,?,"Russia New York, NY"
324,2,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24,?,C,10,?,"Russia New York, NY"
325,2,0,"Aldworth, Mr. Charles Augustus",male,30.0,0,0,248744,13,?,S,?,?,"Bryn Mawr, PA, USA"
326,2,0,"Andrew, Mr. Edgardo Samuel",male,18.0,0,0,231945,11.5,?,S,?,?,"Buenos Aires, Argentina / New Jersey, NJ"
327,2,0,"Andrew, Mr. Frank Thomas",male,25.0,0,0,C.A. 34050,10.5,?,S,?,?,"Cornwall, England Houghton, MI"
328,2,0,"Angle, Mr. William A",male,34.0,1,0,226875,26,?,S,?,?,"Warwick, England"
329,2,1,"Angle, Mrs. William A (Florence 'Mary' Agnes H...",female,36.0,1,0,226875,26,?,S,11,?,"Warwick, England"
330,2,0,"Ashby, Mr. John",male,57.0,0,0,244346,13,?,S,?,?,"West Hoboken, NJ"
331,2,0,"Bailey, Mr. Percy Andrew",male,18.0,0,0,29108,11.5,?,S,?,?,"Penzance, Cornwall / Akron, OH"
332,2,0,"Baimbrigge, Mr. Charles Robert",male,23.0,0,0,C.A. 31030,10.5,?,S,?,?,Guernsey

In [63]:
# informaçoes notna com a pesquisa age
age_no_na =  titanic[titanic["age"].notna()]
age_no_na.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.55,E12,S,3,?,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,?,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0,A36,S,?,?,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,?,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,?,C,?,22,"Montevideo, Uruguay"

In [64]:
# Verificando se teve mudança
age_no_na.shape

(1046, 14)

# Selecionando linhas e colunas específicas de Datraframe

In [ ]:
# procurando as idades d
adultos_name = titanic.loc[titanic["age"]>35, "name"]
adultos_name.head(10)

5                                 Anderson, Mr. Harry
6                   Andrews, Miss. Kornelia Theodosia
7                              Andrews, Mr. Thomas Jr
8       Appleton, Mrs. Edward Dale (Charlotte Lamson)
9                             Artagaveytia, Mr. Ramon
10                             Astor, Col. John Jacob
14               Barkworth, Mr. Algernon Henry Wilson
17    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
19                               Beattie, Mr. Thomson
20                      Beckwith, Mr. Richard Leonard
Name: name, dtype: object

In [ ]:
# usando o iloc para selecinar determinada linhas e colunas